<?php

function filter_right_numbers($num) {
  
   // Если 3 двоеточия то вырезаем кадастровый номер
   preg_match_all("/:/", $num, $colons);
  
   if(isset($colons[0]) && count($colons[0]) === 3) {
     
     if (preg_match("/[-]/", $num) && preg_match("/[:]/", $num) && preg_match("/\//", $num)) {
        preg_match('/[0-9]{2}:[0-9]{2}:[0-9]{6,9}:[0-9]{1,35}/', $num, $matches);

        if(isset($matches[0])) {
          return $matches[0];
        }
      } 
   } // end if(isset($colons[0]) && count($colons[0]) === 3)
  
  
  return $num;
  
}


$num = "02:435:9086/8н:0000:1138";
$num = "38:29:011001:0020:25:428:001:010000380:0001:10044";
$num = "50-50-27/083/2011-380";
$num = "26:12:000000:0000:32022/192:0018/А";
$num = "16:50:110803:0:21/27";
$num = "38:29:011001:0020:25:428:001:010000380:0001:10044";
$num = "63:17:0000000:0:99/3";
$num = "42:30:000000:0000";
$num = "10:21:0000000:7843-10/032/2019-12";
$num = "10:21:0000000:7843-10/032/2019-12";
$num = "23:40:0407023:706-23/012/2018-3";
$num = "№ 77:04:0003005:3418-77/004/2018-2";
$num = "31:07:02 03 004:0034:003803-00/001:0001/А";
$num = "75:18:000003:00:00:00-372/3/129";
//$num = "26:33:150107:0012:7099/186:1001-1005/А";
//$num = "65:01:0501003:1070-65/027/2018-4";
$num = "65:01:0501003:1070";
//$num = "01:05:0200175:25-01/030/2020-3";

echo filter_right_numbers($num);



/*

function get_cn_from_string($cn) {
   // Выдергиваем кадастровый если есть буквы в строке
  if (preg_match("/[а-я]/i", $cn) || preg_match("/[a-z]/i", $cn)) {
    
    // Считаем количество двоеточий, чтобы убедится, что это кадастровый
    preg_match_all("/:/", $cn, $colons);
    
    if(isset($colons[0]) && count($colons[0]) === 3) {
      // Забираем кадастровый номер
      preg_match('/[0-9]{2}:[0-9]{2}:[0-9]{6,9}:[0-9]{1,35}/', $cn, $matches);
      if(isset($matches[0])) {
        return $matches[0];
      }
    }
      
  }
  return $cn;
}

*/


?>




<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <title>Document</title>
</head>

<body>



</body>


</html>
